#+title:  SSH keys on USB
#+subtitle: Linux
#+date:   2022-03-15
#+tags[]: SSH GPG keys linux USB

This is how I keep my SSH key(s) secure: stored on encrypted USB flash-drive, unlock the drive on USB insert, automatically load the key then umount/lock, back to safety.

*** Setup encryption

    It depends on your hardware but on my machine /*aes-xts*/ cipher with /*256-bit*/ key length is the fastest, also /*sha256*/ as password-based key derivation function (PBKDF).
    #+begin_src sh :results output
      cryptsetup benchmark
    #+end_src

    #+RESULTS:
    #+begin_example
    # Tests are approximate using memory only (no storage IO).
    PBKDF2-sha1      1736052 iterations per second for 256-bit key
    PBKDF2-sha256    2216862 iterations per second for 256-bit key
    PBKDF2-sha512    1565038 iterations per second for 256-bit key
    PBKDF2-ripemd160  900838 iterations per second for 256-bit key
    PBKDF2-whirlpool  674759 iterations per second for 256-bit key
    argon2i       8 iterations, 1048576 memory, 4 parallel threads (CPUs) for 256-bit key (requested 2000 ms time)
    argon2id      8 iterations, 1048576 memory, 4 parallel threads (CPUs) for 256-bit key (requested 2000 ms time)
    #     Algorithm |       Key |      Encryption |      Decryption
            aes-cbc        128b      1178.6 MiB/s      3409.0 MiB/s
        serpent-cbc        128b       101.2 MiB/s       753.2 MiB/s
        twofish-cbc        128b       229.7 MiB/s       405.9 MiB/s
            aes-cbc        256b       892.9 MiB/s      2818.4 MiB/s
        serpent-cbc        256b       101.0 MiB/s       753.9 MiB/s
        twofish-cbc        256b       231.1 MiB/s       411.3 MiB/s
            aes-xts        256b      3440.2 MiB/s      3416.4 MiB/s
        serpent-xts        256b       665.6 MiB/s       670.0 MiB/s
        twofish-xts        256b       386.4 MiB/s       391.3 MiB/s
            aes-xts        512b      2798.4 MiB/s      2794.7 MiB/s
        serpent-xts        512b       657.2 MiB/s       665.8 MiB/s
        twofish-xts        512b       385.7 MiB/s       386.3 MiB/s
    #+end_example

    Create LUKS partition with given cipher, length and hash function.
    #+begin_src sh
      cryptsetup --cipher aes-xts-plain64 --key-size 256 --hash sha256 luksFormat /dev/sdb1
    #+end_src

    When you create LUKS partition you will be asked to provide a /passphrase/ but optionally you can add multiple passphrases or keyfiles.
    #+begin_src sh
      cryptsetup luksAddKey /dev/sdb1  # add new passphrase
      cryptsetup luksAddKey /dev/sdb1 /path/to/file # add new keyfile
    #+end_src

    Open our encrypted partition (with either passphrase or keyfile) and it will available under //dev/mapper/NAME/.
    #+begin_src sh
      cryptsetup open /dev/sdb1 keys # open with passphrase
      cryptsetup  --keyfile=/path/to/file open /dev/sdb1 keys # open with keyfile
    #+end_src

*** Create file-system
    Standard /ext4/ linux file-system and set the label for our partition, this is important for auto-mounting later.
    #+begin_src sh
      mkfs.ext4 /dev/mapper/keys
      e2label /dev/mapper/keys keys
    #+end_src

    #+begin_src sh :results output
      lsblk -f /dev/sdb
    #+end_src

    #+RESULTS:
    : NAME     FSTYPE      FSVER LABEL UUID                                 FSAVAIL FSUSE% MOUNTPOINTS
    : sdb
    : ├─sdb1   crypto_LUKS 2           40b90bb8-5bf2-44ab-818b-3385ca82b644
    : │ └─keys ext4        1.0   keys  e36e5613-1f17-4161-a9e6-8b0c1dfe9430
    : └─sdb2

*** SSH key in ssh agent
    Finally, here is the key fingerprint (redacted) in SSH agent.
    #+begin_src sh
      ssh-add -l
    #+end_src

    #+RESULTS:
    : 3072 SHA256:--5-T7Z4/k-dqfyoXw-8Li-fB-5r-4F0-wCyfQ-ccJ- icostan@drakarys (RSA)

